{
  "self": {
    "location": "location",
    "birthday": "birthday",
    "dec": "December"
  },
  "navbar": {
    "about": "about",
    "resume": "resume",
    "portfolio": "portfolio",
    "contact": "contact",
    "language": "language"
  },
  "about": {
    "p1": "Hello, I'm Fandi, a Full Stack Web Developer with a passion for creating web experiences that are not only functional, but also stunning. In the front-end world, I have expertise in implementing designs using HTML, CSS, and JavaScript, and I believe that the use of modern frameworks such as React and Vue brings a new dimension to interactivity and visual appeal.",
    "p2": "In back-end development, I rely on Express to ensure optimal performance and security. I don't just see web development as a job, but as an opportunity to embrace challenges and continue learning. I believe that innovation comes through the desire to continually grow, and I'm always open to digging deeper into the world of web development.",
    "p3": "With a combination of technical expertise and a spirit of exploration, I'm ready to take your web project to the next level. Let's create an unforgettable web experience together!",
    "service": "What I'm Doing",
    "service_head1": "Web Development",
    "service_body1": "I offer stunning website design and development services, powered by modern technology."
  },
  "resume": {
    "edu": {
      "head": "education",
      "stmik": "Informatics Engineering",
      "smkn": "Computer and Network Engineering"
    },
    "exp": {
      "head": "experience",
      "paerte_code": "As a UI/UX Designer who focuses on creating application prototype designs for further development. By understanding user needs, I strive to create simple and effective designs. The tool I use is Figma.",
      "balaroa_head": "Balaroa Sub-District",
      "balaroa": "Create an application to create automatic letters, so that employees only need to enter the required data and letters can be immediately created for community service purposes. using React and Express."
    },
    "now": "now",
    "tools": "My Tools & Skills"
  },
  "portfolio": {
    "all": "all",
    "programming_use": "Programming Language I Used:",
    "my_role": "my role:",
    "frontend": "Frontend developer",
    "about": "About Project",
    "tech": "Technology",
    "feature": "Main Feature",
    "asset_from": "Some assets from: ",
    "demo_link": "Demo link: ",
    "pena": {
      "title": "PENA Website 2022-2023",
      "detail": "Company Profile",
      "data": {
        "title": "Responsive Website And Company Profile",
        "detail": "This website contains various content such as a brief explanation of the organization, names and positions of core management, vision and mission as well as a registration form for prospective new members.",
        "about_p1": "PENA (Programming, Engineering and Networking Adhi Guna) PENA is an internal campus student organization that operates in the technology sector, this website was created in September 2022.",
        "about_p2": "The development of this website was carried out with the team, I acted as a frontend developer whose job was to create the user interface. while the backend is done using Laravel. An example of the user interface display on this website can be seen ",
        "link": "via this link."
      }
    },
    "honey": {
      "title": "Honey Production website",
      "detail": "Landing Page",
      "data": {
        "title": "Responsive Website And Company Profile",
        "detail": "This website is not an original project, but was created as a portfolio and takes from existing references.",
        "about_p1": "Honey Production is a website with the theme of honey production. Suitable for businesses engaged in production and sales, especially honey. for the design I took reference from ",
        "about_p2": " An example of the user interface display on this website can be seen ",
        "link1": "this source.",
        "link2": "via this link."
      }
    },
    "whackamole": {
      "title": "Whack A Mole",
      "detail": "Mini Game",
      "data": {
        "title": "Whack A Mole Web Game",
        "detail": "Whack-a-Mole is an arcade game that tests the player's reflexes and dexterity.",
        "about_p1": "In this project, I designed and implemented the classic web-based game 'Whack-a-Mole'. Whack-a-Mole is an arcade game that tests the player's reflexes and dexterity. In this web version, I combined fun game elements with responsive design for an optimal user experience across devices.",
        "tech_head1": "HTML, CSS, and JavaScript:",
        "tech_head2": "CSS Animations:",
        "tech_body1": "Implement game logic and user interactions using a combination of basic web technologies.",
        "tech_body2": "Leverages CSS animations to create smooth character movements."
      }
    },
    "todolist": {
      "title": "to do list",
      "detail": "Tools App",
      "data": {
        "title": "Simple To-Do List Application with Local Storage",
        "detail": "The app allows users to create, mark as complete, and delete to-do lists quickly and easily.",
        "about_p1": "In this project, I created a simple yet effective web-based To-Do List application. The app allows users to create, mark as complete, and delete to-do lists quickly and easily. One of the key features I implemented was the use of Local Storage to store task data locally on the user's device, allowing users to save their task list even after closing or refreshing the page.",
        "feature_head1": "To-Do List Creation:",
        "feature_head2": "Marking Completed:",
        "feature_head3": "Task Deletion:",
        "feature_head4": "Local Storage:",
        "feature_body1": "Users can easily add new tasks with relevant titles and descriptions.",
        "feature_body2": "Any task can be marked as complete.",
        "feature_body3": "Facility to delete completed or no longer relevant tasks.",
        "feature_body4": "Local storage implementation ensures task data remains available even after page closure or browser refresh.",
        "tech_head1" : "HTML, CSS, and JavaScript:",
        "tech_head2" : "Local Storage:",
        "tech_head3" : "Responsive Design:",
        "tech_body1" : "Implemented a clean, responsive user interface with interaction logic using JavaScript.",
        "tech_body2" : "Utilize Local Storage in the browser to save and load the user's to-do list.",
        "tech_body3" : "Responsive design to be used comfortably on various devices."
      }
    },
    "weather_app": {
      "title": "Weather App",
      "detail": "Weather Forecast"
    },
    "sips_app": {
      "title": "SIPS App",
      "detail": "Application to create automatic letters in Balaroa sub-district"
    }
  },
  "contact": {
    "head": "Contact Me",
    "name": "Full Name",
    "email": "Email Address",
    "message": "Your Message",
    "button": "Send Message",
    "success": "Email sent successfully!!",
    "failed": "Failed to send, something wrong!!",
    "alert": {
      "invalid": "Invalid email",
      "name": "Name is required",
      "email": "Email is required",
      "message": "Message is required"
    }
  }
}