{
  "self": {
    "location": "location",
    "birthday": "birthday",
    "dec": "December"
  },
  "navbar": {
    "about": "about",
    "resume": "resume",
    "project": "project",
    "contact": "contact",
    "language": "language"
  },
  "about": {
    "p1": "Hello, I'm Fandi, a Full Stack Web Developer with a passion for creating web experiences that are not only functional, but also stunning. In the front-end world, I have expertise in implementing designs using HTML, CSS, and JavaScript, and I believe that the use of modern frameworks such as React and Vue brings a new dimension to interactivity and visual appeal.",
    "p2": "In back-end development, I rely on Express to ensure optimal performance and security. I don't just see web development as a job, but as an opportunity to embrace challenges and continue learning. I believe that innovation comes through the desire to continually grow, and I'm always open to digging deeper into the world of web development.",
    "p3": "With a combination of technical expertise and a spirit of exploration, I'm ready to take your web project to the next level. Let's create an unforgettable web experience together!",
    "service": "What I'm Doing",
    "service_head1": "Web Development",
    "service_head2": "Web Based Application",
    "service_body1": "I offer stunning website design and development services, powered by modern technology.",
    "service_body2": "I offer website-based application design and development."
  },
  "resume": {
    "edu": {
      "head": "education",
      "stmik": "Informatics Engineering",
      "smkn": "Computer and Network Engineering"
    },
    "exp": {
      "head": "experience",
      "paerte_code": "As a UI/UX Designer who focuses on creating application prototype designs for further development. By understanding user needs, I strive to create simple and effective designs. The tool I use is Figma.",
      "balaroa_head": "Balaroa Sub-District",
      "balaroa": "Create an application to create automatic letters, so that employees only need to enter the required data and letters can be immediately created for community service purposes. using React and Express."
    },
    "now": "now",
    "tools": "My Tools & Skills"
  },
  "project": {
    "all": "all",
    "programming_use": "Programming Language I Used:",
    "my_role": "my role:",
    "frontend": "Frontend developer",
    "about": "About Project",
    "tech": "Technology",
    "feature": "Main Feature",
    "asset_from": "Some assets from: ",
    "demo_link": "Demo link: ",
    "open_weather": "Open Weather Map API Integration",
    "ux": "User Experience",
    "pena": {
      "title": "PENA Website 2022-2023",
      "detail": "Company Profile",
      "data": {
        "title": "Responsive Website And Company Profile",
        "detail": "This website contains various content such as a brief explanation of the organization, names and positions of core management, vision and mission as well as a registration form for prospective new members.",
        "about_p1": "PENA (Programming, Engineering and Networking Adhi Guna) PENA is an internal campus student organization that operates in the technology sector, this website was created in September 2022.",
        "about_p2": "The development of this website was carried out with the team, I acted as a frontend developer whose job was to create the user interface. while the backend is done using Laravel. An example of the user interface display on this website can be seen ",
        "link": "via this link."
      }
    },
    "honey": {
      "title": "Honey Production website",
      "detail": "Landing Page",
      "data": {
        "title": "Responsive Website And Company Profile",
        "detail": "This website is not an original project, but was created as a portfolio and takes from existing references.",
        "about_p1": "Honey Production is a website with the theme of honey production. Suitable for businesses engaged in production and sales, especially honey. for the design I took reference from ",
        "about_p2": " An example of the user interface display on this website can be seen ",
        "link1": "this source.",
        "link2": "via this link."
      }
    },
    "whackamole": {
      "title": "Whack A Mole",
      "detail": "Mini Game",
      "data": {
        "title": "Whack A Mole Web Game",
        "detail": "Whack-a-Mole is an arcade game that tests the player's reflexes and dexterity.",
        "about_p1": "In this project, I designed and implemented the classic web-based game 'Whack-a-Mole'. Whack-a-Mole is an arcade game that tests the player's reflexes and dexterity. In this web version, I combined fun game elements with responsive design for an optimal user experience across devices.",
        "tech_head1": "HTML, CSS, and JavaScript:",
        "tech_head2": "CSS Animations:",
        "tech_body1": "Implement game logic and user interactions using a combination of basic web technologies.",
        "tech_body2": "Leverages CSS animations to create smooth character movements."
      }
    },
    "todolist": {
      "title": "to do list",
      "detail": "Tools App",
      "data": {
        "title": "Simple To-Do List Application with Local Storage",
        "detail": "The app allows users to create, mark as complete, and delete to-do lists quickly and easily.",
        "about_p1": "In this project, I created a simple yet effective web-based To-Do List application. The app allows users to create, mark as complete, and delete to-do lists quickly and easily. One of the key features I implemented was the use of Local Storage to store task data locally on the user's device, allowing users to save their task list even after closing or refreshing the page.",
        "feature_head1": "To-Do List Creation:",
        "feature_head2": "Marking Completed:",
        "feature_head3": "Task Deletion:",
        "feature_head4": "Local Storage:",
        "feature_body1": "Users can easily add new tasks with relevant titles and descriptions.",
        "feature_body2": "Any task can be marked as complete.",
        "feature_body3": "Facility to delete completed or no longer relevant tasks.",
        "feature_body4": "Local storage implementation ensures task data remains available even after page closure or browser refresh.",
        "tech_head1" : "HTML, CSS, and JavaScript:",
        "tech_head2" : "Local Storage:",
        "tech_head3" : "Responsive Design:",
        "tech_body1" : "Implemented a clean, responsive user interface with interaction logic using JavaScript.",
        "tech_body2" : "Utilize Local Storage in the browser to save and load the user's to-do list.",
        "tech_body3" : "Responsive design to be used comfortably on various devices."
      }
    },
    "weather_app": {
      "title": "Weather App",
      "detail": "Weather Forecast",
      "data": {
        "title": "Web Based Weather Application",
        "detail": "A simple and efficient web-based weather application, allowing users to quickly get up-to-date weather information by city or country.",
        "about_p1": "In this project, I created a simple and efficient web-based weather application, allowing users to quickly get up-to-date weather information based on the city or country they type in a search. I utilize the OpenWeatherMap API service to get accurate real-time weather data.",
        "feature_head1": "Location Search:",
        "feature_head2": "Weather Details View:",
        "feature_head3": "Responsive Design:",
        "feature_body1": "Users can enter the city or country name to get the latest weather information.",
        "feature_body2": "Displays weather details such as temperature, humidity, wind speed and weather conditions in a visual and informative manner.",
        "feature_body3": "Ensures the user interface can be conveniently accessed across devices, from desktop to mobile devices.",
        "tech_head1": "ViteJS + VueJS:",
        "tech_head2": "Axios:",
        "tech_head3": "Bootstrap:",
        "tech_body1": "Uses ViteJS as a rapid web development framework, along with VueJS to manage application components and state.",
        "tech_body2": "Use Axios to make HTTP requests to the OpenWeatherMap API and get weather data.",
        "tech_body3": "Implemented Bootstrap for responsive design and clean user interface components.",
        "open_weather_head1": "Real-Time Weather Data:",
        "open_weather_head2": "Short-Term Forecast:",
        "open_weather_body1": "Integrates OpenWeatherMap API to get up-to-date weather data based on user-entered location.",
        "open_weather_body2": "Provides short-term weather forecasts to help users prepare for their daily activities.",
        "ux_p1": "The Weather App was designed with a focus on ease of use and accessibility of up-to-date weather information. With an intuitive display and efficient search features, users can quickly get the weather information they need."
      }
    },
    "sips_app": {
      "title": "SIPS App",
      "detail": "Application automatic letters in Balaroa sub-district",
      "data": {
        "title": "SIPS App (Letter Creation Information System)",
        "detail": "A system that facilitates the process of making certificates for community services.",
        "about_p1": "In this project I designed the SIPS (Letter Creation Information System) application, which is a system that makes the process of creating community service certificates easier. This application is specifically designed for sub-district offices, allowing employees to create documents needed by residents quickly and efficiently.",
        "about_p2": "This application was created as a technical activity for me when I was a KKLP Internship Student in Balaroa Village.",
        "about_p3": "The SIPS application is designed to increase the efficiency of community services at sub-district offices so that it has a positive impact on administrative processes and community services.",
        "feature_head1": "Employee and Resident Registration:",
        "feature_head2": "Letter Type Selection:",
        "feature_head3": "Citizen Data Storage",
        "feature_head4": "Modern Technology:",
        "feature_head5": "Data Security:",
        "feature_head6": "Modern UI with Tailwind CSS:",
        "feature_body1": "Record the name of the employee who signed the letter and record the demographic information to make it easier to make the deed at a later date.",
        "feature_body2": "Employees can select the desired certificate type, and the application automatically generates a letter with previously entered data.",
        "feature_body3": "Citizen data is stored securely, enabling faster certificate generation for previously registered citizens.",
        "feature_body4": "Uses Vite, React, Express, and MySQL technologies to build applications.",
        "feature_body5": "Implement JSON Web Token (JWT) to secure citizen access and data.",
        "feature_body6": "Implement Tailwind CSS for a clean and modern interface design, speeding up the development process and improving design consistency.",
        "tech_head1": "Vite and React:",
        "tech_head2": "Express and MySQL:",
        "tech_head3": "Axios:",
        "tech_head4": "DaisyUI and SweetAlert:",
        "tech_head5": "Sequelize:",
        "tech_head6": "JSON Web Token (JWT):",
        "tech_head7": "Tailwind CSS:",
        "tech_body1": "These are frontend technologies that provide dynamic user interfaces.",
        "tech_body2": "Used as backend technologies for data and server management.",
        "tech_body3": "Makes communication between frontend and backend easier.",
        "tech_body4": "Enhance the user interface with elegant UI components and engaging notifications.",
        "tech_body5": "Helps in managing MySQL databases with a structured model.",
        "tech_body6": "Used to implement security and authentication.",
        "tech_body7": "A CSS framework used to build user interface designs quickly and consistently."
      }
    },
    "personal_web": {
      "title": "Personal Web",
      "detail": "Landing Page",
      "data": {
        "title": "Responsive Website And Personal Web",
        "detail": "Website landing page containing portfolio content and personal profile",
        "about_p1": "This website was created as a personal website for a short profile and displays the portfolio that I have created. Apart from that, this is also my first portfolio website (before the current one).",
        "about_p2": "I made it using the tailwind CSS UI framework with a dark theme and responsive on various devices."
      }
    }
  },
  "contact": {
    "head": "Contact Me",
    "name": "Full Name",
    "email": "Email Address",
    "message": "Your Message",
    "button": "Send Message",
    "success": "Email sent successfully!!",
    "failed": "Failed to send, something wrong!!",
    "alert": {
      "invalid": "Invalid email",
      "name": "Name is required",
      "email": "Email is required",
      "message": "Message is required"
    }
  }
}